app/controllers/application_controller.rb

    @return_to = new_path

    Maybe(@current_community).each { |community|
      @community_customization = community.community_customizations.where(locale: locale).first
---
SELECT  `community_customizations`.* FROM `community_customizations` WHERE `community_customizations`.`community_id` = 1 AND `community_customizations`.`locale` = 'en' ORDER BY `community_customizations`.`id` ASC LIMIT 1

  def fetch_community_membership
    if @current_user
      @current_community_membership = CommunityMembership.where(person_id: @current_user.id, community_id: @current_community.id, status: "accepted").first
---
SELECT  `community_memberships`.* FROM `community_memberships` WHERE `community_memberships`.`person_id` = 'Zrf1Yjs3fbwzBOcZFANvmg' AND `community_memberships`.`community_id` = 1 AND `community_memberships`.`status` = 'accepted' ORDER BY `community_memberships`.`id` ASC LIMIT 1